AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
#include <project_config.h>
#include <pins_setup.h>
#include <MOTOR_control.h>
#include <motion_control.h>
#include <mathematics.h>
#include <time_service.h>
#include <adc.h>
#include <dma.h>
#include <uart.h>
#include <stm32f407_SPI.h>
#include <mpu9250.h>
#include <softI2C.h>
#include <strategy.h>
#include <camera.h>
#include <lower_board.h>
#include <IRlocator.h>
#include <bluetooth_send.h>
#include <bluetooth_robot.h>
#include <ssd1306_fonts.h>
#include <IMU.h>
#include <line_sensors.h>
#include <gyro.h>
#include <math.h>
#include <cmath>

#define CHANNEL1 1
#define CHANNEL2 2
#define CHANNEL3 3
#define CHANNEL4 4

#define GOALKEEPER 0
#define ATTACKER 1
#define SNIPER 3
#define PENALTY 4
#define DEBUG 5
#define CODE ATTACKER

#define Ec 2.7182818284
#define BALL_SENSOR_THRESHOLD 1800

float getAngleMultipiller(float angle, float dist){
	angle = abs(float(angle));
	if (angle < 15) 
		return 2.3;
	if (angle < 45) 
		return 2.1;
	if (angle < 90) 
		return 1.9;
	if (angle < 135) 
		return 1.7;
	return 1.5;
	/*if (angle < 15) 
		return 1.2;
	if (angle < 45) 
		return 1.8;
	if (angle < 90) 
		return 1.7;
	if (angle < 135) 
		return 1.6;
	return 1.6;*/
}

float getAngleMultipillerGK(float angle){
	angle = abs(float(angle));
	if (angle < 15) 
		return 1.3;
	if (angle < 45) 
		return 1.5;
	if (angle < 90) 
		return 1.3;
	if (angle < 135) 
		return 1.7;
	return 1.5;
	/*if (angle < 15) 
		return 1.2;
	if (angle < 45) 
		return 1.8;
	if (angle < 90) 
		return 1.7;
	if (angle < 135) 
		return 1.6;
	return 1.6;*/
}

double convertDist(double dist) {
			double maxDist = 80;
			double v = (dist - maxDist) / maxDist + 1;
			if (v > 1) 
				v = 1;
			if (v < 0) 
				v = 0;
      return v;
}

float AngleOffset(float angle, float dist){
	/*if (abs(angle) < 45) {
		return angle * 1.1;
	}*/
	double angK = 0.04 * pow(double(Ec), double(0.15 * abs(angle)));
	if (angK > 90)
		angK = 90;
	dist = convertDist(dist);
	double distK = 0.02 * pow(double(Ec), double(4.5 * dist));
	if (abs(angle) < 90) {
		distK = 1;
	}
	//double distK = 1;
	if (distK > 1)
		distK = 1;
	if (angle > 0) {
		return angK * distK;
	} else {
		return -angK * distK;
	}
}

int FAng (int ang) {
	while(ang > 180)
    ang-=360;
  while(ang < -180)
    ang+=360;
  return ang;
}

int getGKSpeed (int ang, int maxSpeed) {
	int sp = abs(abs(float(ang)) - 180) * abs(abs(float(ang)) - 180) / 4;
	if (sp > maxSpeed)
			sp = maxSpeed;
  return sp;
}

int getGKSpeedSlow (int dist, int maxSpeed) {
	int sp = abs(float(dist)) * abs(float(dist)) * 3;
	if (sp > maxSpeed)
			sp = maxSpeed;
  return sp;
}	\

int main()
{
	RCC_APB2PeriphClockCmd(RCC_APB2LPENR_SYSCFGLPEN, ENABLE);
	time_service::init();
	time_service::startTime();
  time_service::delay_ms(500);
	volatile uint32_t bebra = RCC->PLLCFGR;
	//603992080
	/*static Pin dribbler(GPIO_Pin_7,
							GPIOE,
							GPIO_Mode_AF,
							TIM9,
							CHANNEL2,
							RCC_APB2Periph_TIM9,
							GPIO_PinSource6,
							GPIO_AF_TIM9,
							65535,
							1,
							GPIO_OType_PP,
							GPIO_PuPd_NOPULL);
	dribbler.pinInit();
	dribbler.pwmInit();
	dribbler.pwm(32125); */

	uint32_t period = 256;
	static Pin m1In1(GPIO_Pin_6,
									GPIOE,
									GPIO_Mode_AF,
									TIM9,
									CHANNEL2,
									RCC_APB2Periph_TIM9,
									GPIO_PinSource6,
									GPIO_AF_TIM9,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Pin m1In2(GPIO_Pin_5,
									GPIOE,
									GPIO_Mode_AF,
									TIM9,
									CHANNEL1,
									RCC_APB2Periph_TIM9,
									GPIO_PinSource5,
									GPIO_AF_TIM9,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static 	Motor m1(m1In1, m1In2);
	
  static Pin m2In1(GPIO_Pin_14,
									GPIOD,
									GPIO_Mode_AF,
									TIM4,
									CHANNEL3,
									RCC_APB1Periph_TIM4,
									GPIO_PinSource14,
									GPIO_AF_TIM4,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Pin m2In2(GPIO_Pin_15,
	  							 GPIOD,
									 GPIO_Mode_AF,
									 TIM4,
									 CHANNEL4,
									 RCC_APB1Periph_TIM4,
									 GPIO_PinSource15,
									 GPIO_AF_TIM4,
									 period,
									 1,
									 GPIO_OType_PP,
									 GPIO_PuPd_DOWN);
	static Motor m2(m2In2, m2In1);
	
	static Pin m3In1(GPIO_Pin_10,
									GPIOB,
									GPIO_Mode_AF,
									TIM2,
									CHANNEL3,
									RCC_APB1Periph_TIM2,
									GPIO_PinSource10,
									GPIO_AF_TIM2,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Pin m3In2(GPIO_Pin_11,
									GPIOB,
									GPIO_Mode_AF,
									TIM2,
									CHANNEL4,
									RCC_APB1Periph_TIM2,
									GPIO_PinSource11,
									GPIO_AF_TIM2,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Motor m3(m3In1, m3In2);
	
	static Pin m4In2(GPIO_Pin_12,
									GPIOD,
									GPIO_Mode_AF,
									TIM4,
									CHANNEL1,
									RCC_APB1Periph_TIM4,
									GPIO_PinSource12,
									GPIO_AF_TIM4,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Pin m4In1(GPIO_Pin_13,
									GPIOD,
									GPIO_Mode_AF,
									TIM4,
									CHANNEL2,
									RCC_APB1Periph_TIM4,
									GPIO_PinSource13,
									GPIO_AF_TIM4,
									period,
									1,
									GPIO_OType_PP,
									GPIO_PuPd_DOWN);
	static Motor m4(m4In1, m4In2);
	
	static Pin dribbler(GPIO_Pin_9,
							GPIOC,
							GPIO_Mode_AF,
							TIM3,
							CHANNEL4,
							RCC_APB1Periph_TIM3,
							GPIO_PinSource9,
							GPIO_AF_TIM3,
							2000,
							159,
							GPIO_OType_PP,
							GPIO_PuPd_DOWN);
	dribbler.pinInit();
	dribbler.pwmInit();
	
	static Pin changeSideButton(GPIO_Pin_2,
			 GPIOD,
			 GPIO_Mode_IN,
			 TIM3,
			 CHANNEL2,
			 RCC_APB1Periph_TIM3,
			 GPIO_PinSource2,
			 GPIO_AF_USART1,
			 4096,
			 1,
			 GPIO_OType_PP,
			 GPIO_PuPd_DOWN);
	changeSideButton.pinInit();
	
	static Pin startButton(GPIO_Pin_4,
		 GPIOD,
		 GPIO_Mode_IN,
		 TIM3,
		 CHANNEL2,
		 RCC_APB1Periph_TIM3,
		 GPIO_PinSource4,
		 GPIO_AF_USART1,
		 4096,
		 1,
		 GPIO_OType_PP,
		 GPIO_PuPd_DOWN);
	startButton.pinInit();
	
