AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
				//	math.setVector(90, 0);
					//ballCathed = 0; 
					if (tsop.isCanSee() || ballCathed) {
						if (ballCathed) {
							if (goBackFlag == 0) {
								goBackFlag = 1;
								goBackTimer = millis();
							} else {
								math.setVector(180, (millis() - goBackTimer) / 6 > speedFast ? speedFast : (millis() - goBackTimer) / 6);
							}								
							dribblerOn = 2;
							if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 80) {
								kickTimer = millis();
								kickState = 1;
							}
						} else {
							goBackFlag = 0;
							if (abs(float(tsop.getAngle())) < 45 || tsop.getDist() > 60) {
								if (abs(float(tsop.getAngle())) < 90 && tsop.getDist() > 40) {
									math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedSlow); 
								} else {
									math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast); 
								}
								dribblerOn = 1;
							} else {
								math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast); //
							}
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					dribblerOn = 2;
					if (cam.getAnotherCamDist() != 0) {
						gyro.setRotation(180 + cam.getAnotherCamAngle());
					} else {
						gyro.setRotation(180);
					}
					
					if (millis() - kickTimer > 1000) {
						kickState = 0;
						dribblerOn = 0;
					} else {
						if (kickState == 1) {
							if (sin(cam.getAnotherCamAngle() / 57.3) > 0) {
								kickSide = 1;
							} else {
								kickSide = 0;
							}
							if (cam.getGK() > cam.getAnotherCamAngle() && abs(abs(float(cam.getGK())) - abs(float(cam.getAnotherCamAngle()))) > 3) {
								kickState = 3;
							} else {
								kickState = 3;
							}
						} else if (kickState == 2) { 
							dribblerOn = 0;
							if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 50) {
								if(kickSide)
									math.setVector(90 - gyro.getTargetRobotAngle(), speedFast);
								else 
									math.setVector(-90 - gyro.getTargetRobotAngle(), speedFast);
							} else {
								math.setVector(180, 250);
							}
						} else if (kickState == 3) {
							dribblerOn = 2;
							gyro.setMaxSpeed(150);
							cam.setGyroAng(gyro.getDev());
							if(kickSide)
								gyro.setRotation(10 + cam.getAnotherCamAngle());
							else 
								gyro.setRotation(-10 + cam.getAnotherCamAngle());
						}
						/*dribblerOn = 0;
						if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 50) {
							if(sin(cam.getAnotherCamAngle() / 57.3)) < 0)
								math.setVector(90 - gyro.getTargetRobotAngle(), speedFast);
							else 
								math.setVector(-90 - gyro.getTargetRobotAngle(), speedFast);
						} else {
							math.setVector(180, 256);
						}*/
						//math.setVector(180, 250);
						/*if (kickState == 1 || 1 == 1) {
							//math.setVector(0, 0);
							//if (abs(float(cam.getGK())) > abs(float(cam.getAnotherCamAngle())))
							//if (abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 50) {
							//math.setVector(90 - gyro.getTargetRobotAngle(), speedFast);
							//} else {
						//		math.setVector(180, 256);
							//}
						} else if (kickState == 2) {
								
						} else if (kickState == 3) {
							
						}*/
					}
				}
				testAng = tsop.getDist();
				//math.setVector(0, 0); 
				/*if (tsop.isCanSee()) {
					gyroFlag = 1;
					gyro.setRotation(tsop.il8	getAngle());
					tsop.setGyroAng(gyro.getDev());
					math.setVector(tsop.getLocalAngle(), 0);//speedSlow);
				} else {
					gyroFlag = 0;
					gyro.setRotation(0);
					tsop.setGyroAng(0);
					math.setVector(0, 0);
				}*/
				/*if (f == 0) {
					timer = millis();
					f = 1;
				} else {
					if (millis() - timer > 3000) {
						gyro.setRotation(90);
						math.setVector(0, 0);
					} else if (millis() - timer > 2750) {
						gyro.setRotation(90);
						math.setVector(90, speedFast);
					} else {
						math.setVector(90, speedFast);
					}
				}*/
				
				/*if (tsop.isCanSee()) {
					//testAng = tsop.getAngle();
					math.setAngle(tsop.getAngle() * 1.5);
					
					if (abs(float(tsop.getAngle())) < 15) {
						math.setAngle(tsop.getAngle());
						math.setSpeed(speedFast);
					} else {
						mat.setSpeed(speedSlow);
					}
				}*/
				/*if (gyroFlag == 0) {
					k = gyro.getAngle();
				} else {
					if (abs(float(gyro.getDevFromTarget())) < 30) {
						k = gyro.getRotationKForRotateToBall(1, 0);
					} else {
						k = gyro.getRotationKForRotateToBall(1, 0);
					}
				}*/
				testAng = tsop.getAngle();
				k = gyro.getAngle();
				if (dribblerOn == 0) {
					dribbler.pwm(150);
				} else if (dribblerOn == 1) {
					dribbler.pwm(292);
				} else if (dribblerOn == 2) {
					dribbler.pwm(292);
				}
				//math.setVector(0, 0); 
			} else if (CODE == GOALKEEPER) {
				int speedGK = 210; 			
				int speedGKSlow = 210; 							
				math.setVector(0, 0);
				int angAng = 130;
				int tAng = 0;
				if (abs(float(tsop.getAngle())) > 90) {
					tAng = FAng(-tsop.getAngle()); 
				} else {
					tAng = FAng(tsop.getAngle() - cam.getCamAngle()); 
				}
				
				int yCoord = abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3));

				
				if(tsop.isCanSee()) {
					if (abs(float(tAng)) < 170 || abs(float(tAng)) > 10) {
						if (abs(float(cam.getCamAngle())) > angAng) {
							if (tAng < 0) {
								math.setVector(90, getGKSpeed(tAng, speedGK));
							} else {
								math.setVector(-90, getGKSpeed(tAng, speedGK));
							}
						} else {
							if (tAng < 0) {
								if (cam.getCamAngle() < 0) {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, speedGK));
								}
							} else {
								if (cam.getCamAngle() > 0) {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, speedGK));
								}
							}
							if (yCoord < 20) {//(abs(float(cam.getCamAngle())) < 130) {
								if (cam.getCamAngle() < 0 && tAng < 0) {
									math.setVector(0, 0);
								}
								if (cam.getCamAngle() > 0 && tAng > 0) {
									math.setVector(0, 0);
								}
							}
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					if (abs(float(cam.getCamAngle())) < 170) {
						if (cam.getCamAngle() > 0) {
							math.setVector(cam.getCamAngle() - 90, speedGKSlow);
						} else {
							math.setVector(cam.getCamAngle() + 90, speedGKSlow);
						}
					} else {
						math.setVector(0, 0);
					}
				}
				
				//STOP FLAGS
				if (yCoord < 20) { //(abs(float(cam.getCamAngle())) < 130) {
					if((cam.getCamAngle() < 0 || (abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 4)) && tAng < 0) {
						math.setVector(0, 0);
					}
					if((cam.getCamAngle() > 0 || (abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 4)) && tAng > 0) {
						math.setVector(0, 0);
					}
				}
				
				/*if(tsop.isCanSee()) {
					if ((abs(float(tAng)) > 160 || abs(float(tsop.getAngle())) < 60) && tsop.getDist() > 20) { 
						if (gkGo == 0) { 
							gkGo = 1;
							timer = millis();
						}
						if (gkGo == 1 && millis() - timer > 1500) { 
							gkGo = 2;
							timer = millis();
						}
						if (gkGo == 2 && millis() - timer < 1500) { 
							if (tsop.getDist() > 40) {
								if (abs(float(tsop.getAngle())) < 45) {
									math.setVector(tsop.getAngle() + (tsop.getAngle() > 0 ? 60 : -60), speedGKSlow);
								} else {
									math.setVector(tsop.getAngle() + (tsop.getAngle() > 0 ? 60 : -60), speedGK);
								}
								if (abs(float(tsop.getAngle())) < 15) {
									if (tsop.getDist() > 60) {
										math.setVector(cam.getAnotherCamAngle(), speedGK);
									} else {
										math.setVector(tsop.getAngle()  * 1.1, speedGK);
									}
								}
							} else {
								if (tsop.getDist() < 30) {
										math.setVector(tsop.getAngle(), speedGK);
								} else {
										math.setVector(tsop.getAngle(), speedGK);
								}
							}
						}
						if (gkGo == 2 && millis() - timer >= 1500) { 
							gkGo = 0;
						}
					}
				}*/
				
