AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
				if (gkGo != 2) {
					if (abs(float(cam.getCamAngle())) > angAng) {	
						if (yCoord > 30) {
							math.addVector(180, getGKSpeedSlow(yCoord - 30, speedGK));
						} else {
							math.addVector(0, getGKSpeedSlow(yCoord - 30, speedGK));
						}
					} else {
						if (cam.getCamDist() > 40) {
							math.addVector(cam.getCamAngle(), getGKSpeedSlow(cam.getCamDist() - 40, speedGK));	
						} else {
							math.addVector(cam.getCamAngle() + 180, getGKSpeedSlow(cam.getCamDist() - 40, speedGK));
						}
					}
				} else {
					if (abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) > 50 || tsop.getDist() < 20) {
						gkGo = 0;
					}
				}
				
				if (yCoord < 15) {
					math.setVector(0, speedGK);
				} 
				
				testAng = tAng;
				//math.setVector(0, 0);

				k = gyro.getAngle();
			}
		} else {
			//dribbler.pwm(90);
			math.setVector(0, 0);
			timer = 0;
			f = false;
			k = 0;
		}		
		math.calculateSpeed(math.getAngle(), math.getSpeed(), sp1, sp2, sp3, sp4);
		robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k, math.getPeriod());
	}
//	int mf[1024]z===
//	int c = 0;
		/*while(1)
	{
		robot.move(3000, 3000, 3000, 3000);
		if(0 == 1 && button.readPin()){
			gyro.read();
			gyro.setRotationByGyro();
		}
		tsop.read();
		cam.readData();
		gyro.read();
		if(0==1 && switchPin.readPin())
		{
			if(CODE == ATTACKER) {
				int speedFast = 2500;
				int speedSlow = 3000;			
				volatile int tAng = tsop.getAngle() - cam.getCamAngle();
				math.setVector(0, 0);
				cam.setGyroAng(0);
				gyro.setRotation(0);
				tsop.setGyroAng(0);
				gyro.setMaxSpeed(4096);
				
				if (cam.getCamDist() != 0) {
					cam.setGyroAng(gyro.getDev());
				}
				
				if (tsop.isCanSee()) {
					if(abs(float(tsop.getAngle())) > 20 || 1 == 1) {
						math.setAngle(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()));
						if ((abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) < 30 && cam.getCamDist() != 0) || (abs(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3)) < 30 && cam.getAnotherCamDist() != 0)) {
							if (abs(float(tsop.getAngle())) < 30) {
								math.setSpeed(speedFast);
							} else {
								math.setSpeed(speedFast);
							}
						} else {
							if (abs(float(tsop.getAngle())) < 30) {
								math.setSpeed(speedFast);
							} else {
								math.setSpeed(speedFast);
							}
						}
					} else {
						if (abs(cam.getCamDist() * cos(gyro.getTargetRobotAngle() / 57.3)) < 60) {
							math.setVector(0, speedSlow);
						} else {
							math.setVector(0, speedFast);
						}
					}
				} else {
					math.setVector(0,0);
				}
				
//				if (tsop.isCanSee()) {
//					tsop.setGyroAng(gyro.getDev());
//				}
// 				
//				if(true) { //Ball cathed
//					double x = cam.getCamDist() * sin(cam.getCamAngle() / 57.3);
//					double y = 85 - cam.getCamDist() * cos(cam.getCamAngle() / 57.3);
//					if (state == 0) {
//						math.setStartDot(x, y);
//						state = 1;
//						timer = millis();
//					} else {
//						//math.setAngle(atan2(y, x) * 57.3);
//						if (millis() - timer > 0) {
//							math.getVecFromTr(x, y, millis() - timer, sp, ang);
//							timer = millis();
//						}
//						math.setSpeed(sp);
//						math.setAngle(ang - gyro.getDev());
//						if (math.isArrived(x, y)) {
//							state = 2;
//						}
//					}
//				} else {
//					state = 0;
//					if (tsop.isCanSee()) {
//						if(abs(float(tsop.getDist())) > 50) {
//							if(abs(double(gyro.getTargetRobotAngle())) < 15) {
//								math.setVector(0, 2500);
//							} else {
//								if(gyro.getTargetRobotAngle() > 0) {
//									math.setVector(90, 2000);
//								} else {
//									math.setVector(-90, 2000);
//								}
//							}						
//						} else {
//							math.setVector(0, 2500);
//						}
//					} else {
//						math.setVector(0, 0);
//					}
//				}
				
				//Line detecting
//				if(cam.getCamDist() != 0) 
//				{
//					if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) > 42)
//					{
//						math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
//					}
//					if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) < -42)
//					{
//						math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
//					}
//					if(abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 10)	
//					{
//						math.setVector(180 - gyro.getTargetRobotAngle(), speedFast);
//					}
//					if(cam.getCamDist() < 40)	
//					{
//						math.addVector(180 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
//					}
//				}	
//				if(cam.getAnotherCamDist() != 0) 				
//				{
//					if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) < -42)	
//					{
//						math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
//					}
//					if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) > 42)	
//					{
//						math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
//					}
//					if(abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 55)
//					{
//						math.setVector(0 - gyro.getTargetRobotAngle(), speedFast);
//					}
//				}
					
				k = gyro.getAngle();
				if (abs(float(gyro.getDevFromTarget())) > 30 && state != 3)
					math.setSpeed(0);
				
				math.calculateSpeed(math.getAngle(), math.getSpeed(), sp1, sp2, sp3, sp4);
				volatile int a = math.getAngle();
				robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k);
				//
			} 
			else if(CODE == GOALKEEPER) {
				int speedGK = 3000; 				
				math.setVector(0, 0);
				volatile int tAng = FAng(tsop.getAngle() - cam.getCamAngle()); 
				
				if(tsop.isCanSee()) {
					if (abs(float(tAng)) < 170) {
						if (abs(float(cam.getCamAngle())) > 150) {
							if (tAng < 0) {
								math.setVector(90, getGKSpeed(tAng, speedGK));
							} else {
								math.setVector(-90, getGKSpeed(tAng, speedGK));
							}
						} else {
							if (tAng < 0) {
								math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, speedGK));
							} else {
								math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, speedGK));
							}
							if (abs(float(cam.getCamAngle())) < 140) {
								if(cam.getCamAngle() < 0 && tAng < 0) {
									math.setVector(0, 0);
								}
								if(cam.getCamAngle() > 0 && tAng > 0) {
									math.setVector(0, 0);
								}
							}
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					if (abs(float(cam.getCamAngle())) < 170) {
						if (cam.getCamAngle() > 0) {
							math.setVector(cam.getCamAngle() - 90, 2000);
						} else {
							math.setVector(cam.getCamAngle() + 90, 2000);
						}
					} else {
						math.setVector(0, 0);
					}
				}
				
				if(tsop.isCanSee()) {
					if ((abs(float(tAng)) > 160 || abs(float(tsop.getAngle())) < 60) && tsop.getDist() > 20) { 
						if (gkGo == 0) { 
							gkGo = 1;
							timer = millis();
						}
						if (gkGo == 1 && millis() - timer > 1500) { 
							gkGo = 2;
							timer = millis();
						}
						if (gkGo == 2 && millis() - timer < 1500) { 
							if (tsop.getDist() > 40) {
								if (abs(float(tsop.getAngle())) < 45) {
									math.setVector(tsop.getAngle() + (tsop.getAngle() > 0 ? 60 : -60), 2000);
								} else {
									math.setVector(tsop.getAngle() + (tsop.getAngle() > 0 ? 60 : -60), speedGK);
								}
								if (abs(float(tsop.getAngle())) < 15) {
									if (tsop.getDist() > 60) {
										math.setVector(cam.getAnotherCamAngle(), speedGK);
									} else {
										math.setVector(tsop.getAngle()  * 1.1, speedGK);
									}
								}
							} else {
								if (tsop.getDist() < 30) {
										math.setVector(tsop.getAngle(), speedGK);
								} else {
										math.setVector(tsop.getAngle(), speedGK);
								}
							}
						}
						if (gkGo == 2 && millis() - timer >= 1500) { 
							gkGo = 0;
						}
					}
				}
				
